In [1]:
#работа с sqlite

In [2]:
import sqlite3 
from prettytable import from_db_cursor

In [3]:
import os
TEMP_DIR ='temp'
if not os.path.exists(TEMP_DIR):
    os.mkdir(TEMP_DIR)

In [6]:
#db_name = os.path.join(TEMP_DIR, 'temp_SQLite.db')
db_name = ":memory:"
print(db_name)

db = sqlite3.connect(db_name)
cur = db.cursor()

:memory:

In [9]:
cur.execute("CREATE TABLE Cities (id integer PRIMARY KEY AUTOINCREMENT NOT NULL, name VARCHAR(30) UNIQUE NOT NULL)")

In [12]:
cur.execute("select * from cities")
from_db_cursor(cur)

+----+------+
| id | name |
+----+------+
+----+------+

In [13]:
cur.execute("PRAGMA table_info('cities')")
from_db_cursor(cur)

+-----+------+-------------+---------+------------+----+
| cid | name |     type    | notnull | dflt_value | pk |
+-----+------+-------------+---------+------------+----+
|  0  |  id  |   INTEGER   |    1    |    None    | 1  |
|  1  | name | VARCHAR(30) |    1    |    None    | 0  |
+-----+------+-------------+---------+------------+----+

In [14]:
cur.execute("INSERT INTO cities(name) VALUES ('Севастополь')")
from_db_cursor(cur.execute("select * from cities"))

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
+----+-------------+

In [25]:
cities = "Москва, Воронеж, Калуга".split(', ')
cities

['Москва', 'Воронеж', 'Калуга']

In [26]:
[(city,) for city in cities]

[('Москва',), ('Воронеж',), ('Калуга',)]

In [28]:
cur.executemany("INSERT INTO cities(name) Values (?)", [(city,) for city in cities])

In [29]:
sql = "INSERT INTO cities(name) Values (?)"
cur.execute(sql, ('Тула',))
from_db_cursor(cur.execute("select * from cities"))

+----+-------------+
| id |     name    |
+----+-------------+
| 1  | Севастополь |
| 2  |    Москва   |
| 3  |   Воронеж   |
| 4  |    Калуга   |
| 5  |     Тула    |
+----+-------------+

In [35]:
sql = """ 
UPDATE cities 
SET name = 'г. ' || name
WHERE name NOT LIKE 'г. ' """

In [33]:
cur.execute(sql)
from_db_cursor(cur.execute("select * from cities"))

+----+----------------+
| id |      name      |
+----+----------------+
| 1  | г. Севастополь |
| 2  |   г. Москва    |
| 3  |   г. Воронеж   |
| 4  |   г. Калуга    |
| 5  |    г. Тула     |
+----+----------------+

In [37]:
print(cur.execute("select * from cities").fetchone())

(1, 'г. Севастополь')

In [38]:
print(cur.execute("select * from cities").fetchmany(size = 3))

[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж')]

In [39]:
print(cur.execute("select * from cities").fetchall())

[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж'), (4, 'г. Калуга'), (5, 'г. Тула')]

In [41]:
print(cur.execute("select * from cities").fetchall()[1:4])

[(2, 'г. Москва'), (3, 'г. Воронеж'), (4, 'г. Калуга')]

In [46]:
print(cur.execute("select * from cities LIMIT 3").fetchall())

[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж')]

In [50]:
t =  cur.execute("select * from cities").fetchall()
print(type(t))
print(t)
print(t[:3])

<class 'list'>
[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж'), (4, 'г. Калуга'), (5, 'г. Тула')]
[(1, 'г. Севастополь'), (2, 'г. Москва'), (3, 'г. Воронеж')]

In [48]:
from_db_cursor(cur.execute("select * from cities"))

+----+----------------+
| id |      name      |
+----+----------------+
| 1  | г. Севастополь |
| 2  |   г. Москва    |
| 3  |   г. Воронеж   |
| 4  |   г. Калуга    |
| 5  |    г. Тула     |
+----+----------------+